//1)
let arr = ['a','b', 'c','d'];
console.log(arr[0],'+',arr[1] ,arr[2],'+',arr[3])

//2)
let mun = [10,15,9,10];
let result = (mun[0]*mun[1] + mun[2]*mun[3])
console.log(result)

//3)
let age = ['a','b', 'c']
age.push(1,2,3);
console.log(age);


//push-добавляет элемент в конец.
//shift-удаляет элемент в начале, сдвигая очередь, так что второй элемент становится первым.
//pop-удаляет последний элемент.
//shift-Удаляет из массива первый элемент и возвращает его:
//unshift-Добавляет элемент в начало массива: